'use strict';

//Завдання 1 Якщо змінна a дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Неправильно'.
const a = +prompt('Введіть число');
let accessAllowed = a = 0 ? 'вірно' : 'неправильно';
console.log(accessAllowed);

//Завдання 2 Якщо змінна a більша за нуль, то виведіть 'Вірно', інакше виведіть 'Невірно'.
const a = +prompt('Введіть число');
let accessAllowed = a > 0 ? 'вірно' : 'невірно';
console.log(accessAllowed);

//Завдання 3 Якщо змінна a менша за нуль, то виведіть 'Вірно', інакше виведіть 'Невірно'.
const a = +prompt('Введіть число');
 let accessAllowed = a < 0 ? 'вірно' : 'невірно';
 console.log(accessAllowed);

//Завдання 4  Якщо змінна a більша або дорівнює нулю, то виведіть 'Вірно', інакше виведіть 'Неправильно'.
const a = +prompt('Введіть число');
 let accessAllowed = a >= 0 ? 'вірно' : 'неправильно';
 console.log(accessAllowed);

// 5  Якщо змінна a менша або дорівнює нулю, то виведіть 'Вірно', інакше виведіть 'Неправильно'.
const a = +prompt('Введіть число');
 let accessAllowed = a <= 0 ? 'вірно' : 'неправильно';
 console.log(accessAllowed);

//Завдання 6  Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'.
const a = +prompt('Введіть число');
  let accessAllowed = a != 0 ? 'вірно' : 'невірно';
  console.log(accessAllowed);

// 7  Якщо змінна a дорівнює 'test', виведіть 'Вірно', інакше виведіть 'Неправильно'.
   const a = prompt('Введіть');
   let accessAllowed = a === "test" ? 'вірно' : 'невірно';
   console.log(accessAllowed);

//Завдання 8  Якщо змінна a дорівнює '1' і за значенням і типом, то виведіть 'Вірно', інакше виведіть 'Невірно'.
const a = prompt('Введіть');
let accessAllowed = a === '1' && typeof a==='number' ? 'вірно' : 'невірно';
console.log(accessAllowed);

//Завдання 9 Якщо змінна a більша за нуль і менше 5-ти, то виведіть 'Вірно', інакше виведіть 'Невірно'.
 const a = prompt('Введіть');
let accessAllowed = a > 0 && a < 5 ? 'вірно' : 'невірно';
console.log(accessAllowed);

//Завдання 10 Якщо змінна a дорівнює нулю або дорівнює двом, додайте до неї 7, інакше поділіть її на 10. Виведіть нове значення змінної на екран.
 const a = +prompt('Введіть')
 let accessAllowed = a == 0 || a == 2 ? a + 7 : a / 10;
 alert(accessAllowed);

//Завдання 11 Якщо змінна a дорівнює або менше 1, а змінна b більша або дорівнює 3, то виведіть суму цих змінних, інакше виведіть їх різницю (результат віднімання).
  const a = +prompt('Введіть перше число')
  const b = +prompt ('Ведіть друге число ')
  let accessAllowed = a <= 1 || b >= 3 ? a + b : a - b;
  alert(accessAllowed);

//Завдання 12 Якщо змінна a більше 2-х і менше 11-ти, або змінна b більша або дорівнює 6-ти і менше 14-ти, то виведіть 'Вірно', інакше виведіть 'Невірно'.
const a = +prompt('Введіть перше число')
const b = +prompt ('Ведіть друге число ')
let accessAllowed = a > 2 && a < 11 || b >= 6 && b < 14 ? 'вірно' : 'невірно';
alert(accessAllowed);

// Завдання 13 Змінна num може приймати 4 значення: 1, 2, 3 або 4. Якщо вона має значення 1, то в змінну result запишемо зима, якщо має значення 2 - весна і так далі. Розв'яжіть завдання через switch-case.
const num = prompt ();
let result = "";

switch (num) {
    case '1' :
        result = "зима"
        break;
    case '2' :
        result = "весна"
        break;
    case '3' :
        result = "осінь"
        break;
    case '4' :
        result = "літо"
        break;
    default :
        result = 'невідома пора року'
}
alert (result)