'use strict'

// Приклад 1 - в цьому випадку буде undefined тому, що хостинг не перенесе значення самої зміни лише ії ініціалізує

// Приклад 2 - в цьому випадку відобразиться Hello World тому, що хостінг піднімає на верхній рівень і таким чином код працює коректно

// Приклад 3 - в цьому випадку змінна let ініціалізується, але видасть помилку, бо попаде у зону TDZ

// Приклад 4 - в цьому випадку виведе у консоль 'Hello from arrow function' тому, що ми визначаэмо стрілкову функцію та викликаємо ії

// Код з успішним виконанням hosting :

const rightHosting = function (a, b) {
  a = 5
  b = 10
  return a + b
}
rightHosting()

//  Код з неправильним виконанням hosting - не виконується тому, що значення не переноситься:

console.log(a - b)
const a = 5
const b = 15
